{
    "title": "Бахтовар",
    "welcome": {
        "iam": "Ман Бобоев Бахтовар.",
        "titles": "Ман як таҳиягари пешқадам ҳастам, ки ҳаваси эҷоди веб замимаҳои муосир, интерактивӣ ва барои корбарро дӯст медорам. Сафари рушди ман аз омӯзиши амиқи HTML, CSS ва JavaScript оғоз шуд, ки ба ман имкон дод, ки барои кори минбаъда бо абзорҳо ба монанди React, TypeScript ва Redux заминаи мустаҳкам бунёд кунам."
    },
    "languege": {
        "russion":"Русскиӣ",
        "english":"Аглисӣ",
        "tajik":"Тоҷики"
    },
    "skills": {
        "react": {
            "rt":  "Уверенно работаю с библиотекой React:",
            "rt2":  "Ман компонентҳоро бо истифодаи усулҳои функсионалӣ ва синфӣ таҳия ва сохта мекунам. Ман hooks-ҳоро (useState, useEffect, useMemo, useReducer ва дигарон) барои идора кардани ҳолат ва давраи ҳаёти компонентҳо истифода мебарам. Ман китобхонаҳои сеюм (React Hook Form, React Slick, React Router ва дигарон) интегратсия мекунам. Ман интераксияи компонентҳоро бо сервер бо истифодаи Axios ё Fetch API конфигур мекунам."
        },
        "javascript":{
            "js":"Ман дониши амиқи асосҳои забон дорам: ES6+ (функсияҳои тир, вайрон кардани структура, ваъдаҳо, async/await). Ман консепсияҳои OOP ва барномасозии функсионалиро мефаҳмам ва истифода мекунам. Ман бо DOM, ҳодисаҳо, дархостҳои AJAX кор мекунам. Ман таҷриба дорам бо JavaScript барои танзими интераксия бо API." 
        },
        "typescript": {
            "ts":"Ман барои навиштани компонентҳо дар React TypeScript-ро истифода мебарам. Ман бо интерфейсҳо, намудҳо, генераикҳо кор мекунам. Ман барои пешгирии хатогиҳо дар марҳилаи рушд навиштани қатъиро истифода мебарам. Ман лоиҳаҳоро бо TypeScript танзим мекунам, аз ҷумла танзими tsconfig.json."
        },
        "redux": {
            "rd": "Ман бо Redux Toolkit кор мекунам, то идоракунии ҳолатро содда кунам. Ман магазин, редюсерҳо, амалҳо ва селекторҳоро эҷод ва пайваст мекунам. Ман барномаро тавассути мемоизатсияи маълумот (reselect) оптимизатсия мекунам. Ман интераксияи Redux-ро бо дархостҳои асинхронӣ тавассути миёнарав (Redux Thunk, Redux Saga) амалӣ мекунам."
        },
        "git":{
            "gt": "Ман дар асбобҳои назорати версия боварӣ дорам. Ман бо шохаҳо, муттаҳидсозӣ ва ҳал кардани ихтилофҳо кор кардаам. Ман фармонҳои асосӣ ва амалҳоро медонам: pull, push, commit, rebase, cherry-pick, stash."
        },
        "html":{
            "htmls": "Ман интерфейсҳои мутобиқшаванда ва кросс-браузерӣ эҷод мекунам. Ман усулҳои муосирро барои тарҳрезӣ истифода мебарам: Flexbox, Grid Layout. Ман пешрафткунандагон ва чаҳорчӯбаҳо (Tailwind CSS, Bootstrap) истифода мекунам. Ман иҷрои интерфейсҳоро оптимизатсия мекунам, то боркунии саҳифаро тезтар кунам."
        }
    },
    "header": {
        "hello": "Салом",
        "skills": "Маҳорат",
        "contact": "Бо ман тамос гиред",
        "portfolio": "Портфел",
        "education": "Маориф",
        "experience": "Таҷриба"
    },
    "data": {
        "phone": "Номер",
        "email": "Почтаи электронӣ",
        "addres": {
            "for": "Адрес",
            "in": "Таҷикистон/Душанбе"
        },
        "social": "Шабакахо иҷтимоӣ"
    },
    "javascript": {
        "edplace":"Илмхона – Маркази таълимӣ",
        "month": "Июни 2024 - Августи 2024",
        "obou":"Асосҳои JavaScript-ро омӯзед, аз ҷумла:",
        "for":"Тағйирёбандаҳо, функсияҳо, ҳалқаҳо ва шартҳо. Кор бо DOM ва рӯйдодҳо. Барномасозии асинхронӣ: ваъдаҳо, асинхронӣ / интизорӣ. Асосҳои кор бо REST API."
    },
    "portfo":"Инҳоянд лоиҳаҳои React ман дар барномасози",
    "kurs":"Курсхо:",
    "react": {
        "edplace":"Илмхона – Маркази таълимӣ",
        "month": "Августи 2024 – Декабри 2024",
        "obou":"Азхудкунии React барои таҳияи интерфейси корбар:",
        "for":"Эҷоди ҷузъҳо ва истифодаи JSX. Идоракунии давлатӣ бо истифода аз қалмоқҳо (useState, useEffect). Асосҳои масир (React Router). Кор бо API-ҳои беруна, Axios. Муқаддима ба идоракунии давлатӣ бо Redux."
    },
    "resume": "Резюме",
    "errors":{
        "er":"Номи худро ворид кунед",
        "koremail":"Суроғаи почтаи электронии дурустро ворид кунед",
        "emailer":"Почтаи электронии худро ворид кунед",
        "messege": "Паём ворид кунед",
        "but":"Фиристодан"
    }
}