{
    "title": "Бахтовар",
    "welcome": {
        "iam": "Я Бобоев Бахтовар.",
        "titles": "Я — начинающий фронтенд-разработчик, увлеченный созданием современных, интерактивных и удобных для пользователя веб-приложений. Мой путь в разработке начался с глубокого изучения HTML, CSS и JavaScript, что позволило мне строить прочные основы для дальнейшей работы с такими инструментами, как React, TypeScript и Redux."
    },
    "menu": "Меню",
    "languege": {
        "russion":"Русский",
        "english":"Аглийский",
        "tajik":"Таджикский"
    },
    "skills": {
        "react": {
            "rt":  "Уверенно работаю с библиотекой React:",
            "rt2":  "Разрабатываю и структурирую компоненты с использованием функционального и классового подходов.Использую хуки (useState, useEffect, useMemo, useReducer и другие) для управления состоянием и жизненным цикломкомпонентов.Интегрирую сторонние библиотеки (React Hook Form, React Slick, React Router и другие).Настраиваю взаимодействие компонентов с сервером с помощью Axios или Fetch API."
        },
        "javascript":{
            "js":"Обладаю уверенными знаниями основ языка: ES6+ (стрелочные функции, деструктуризация, промисы, async/await).Понимаю и применяю концепции ООП и функционального программирования.Работаю с DOM, событиями, AJAX-запросами.Есть опыт работы с JavaScript для настройки взаимодействия с API." 
        },
        "typescript": {
            "ts":"Использую TypeScript для типизации компонентов в React.Работаю с интерфейсами, типами, generic'ами.Применяю строгую типизацию для предотвращения ошибок на этапе разработки.Настраиваю проекты с TypeScript, включая конфигурацию tsconfig.json."
        },
        "redux": {
            "rd": "Работаю с Redux Toolkit для упрощения управления состоянием.Создаю и подключаю store, reducers, actions, selectors.Оптимизирую приложение через мемоизацию данных (reselect).Реализую взаимодействие Redux с асинхронными запросами через middleware (Redux Thunk, Redux Saga)."
        },
        "git":{
            "gt": "Уверенно владею инструментами контроля версий.Работал с ветками (branching), слиянием (merge) и разрешением конфликтов.Знаю основные команды и практики: pull, push, commit, rebase, cherry-pick, stash."
        },
        "html":{
            "htmls": "Создаю адаптивные, кроссбраузерные интерфейсы.Использую современные подходы к верстке: Flexbox, Grid Layout.Применяю препроцессоры и фреймворки (Tailwind CSS, Bootstrap).Оптимизирую производительность интерфейсов для ускорения загрузки страниц."
        }
    },
    "header": {
        "hello": "Приветствие",
        "skills": "Навыки",
        "contact": "Свяжитесь со мной",
        "portfolio": "Портфель",
        "education": "Образование",
        "experience": "Опыт"
    },
    "data": {
        "phone": "Номер",
        "email": "Электронная почта",
        "addres": {
            "for": "Адрес",
            "in": "Таджикстан/Душанбе"
        },
        "social": "Социальный"
    }
}